tutorials/dropSplash/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//Domain length in x-direction
L   1;
//Number of cells in x-direction
nx  30;

//Domain limits in y-direction
y1  0;
y2  1;
//Number of cells in y-direction
ny  30;

//Domain length in z-direction
H   1;
//Number of cells in z-direction
nz  30;

vertices
(
    (0 $y1 0)
    ($L $y1 0)
    ($L $y2 0)
    (0 $y2 0)
    (0 $y1 $H)
    ($L $y1 $H)
    ($L $y2 $H)
    (0 $y2 $H)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
