tutorials/dropSplash/baseCase/system/dropParms
dropCentre    (0.5 0.8 0.5);
dropRadius    0.07;
dropSpeed     -2;