tutorials/dropSplash/baseCase/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include dropParms

field alpha.water;
type composedFunction;
mode add;
composedFunction
{
    //Making water surface
    plane
    {
        type plane;
        origin (0 .4 0);
        normal (0 -1 0);
    }

    //Making droplet
    sphere
    {
        type sphere;
        radius $dropRadius;
        origin $dropCentre;
        scale 1;
    }
}


// ************************************************************************* //
