tutorials/dropSplash/baseCase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include dropParms

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
);

regions
(
    sphereToCell
    {
        origin    $dropCentre;
        radius    $dropRadius;

        fieldValues
        (
            //Initial droplet velocity
            volVectorFieldValue U (0 $dropSpeed 0)
        );
    }
);


// ************************************************************************* //
